app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-11-06 20:09:22.628871"], ["updated_at", "2020-11-06 20:09:22.628871"]]